1s/ERP/Conf/Documents/Лико_СписаниеИзЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_СписаниеИзЭксплуатации</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_СвязиСТиповымиДокументами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_СвязиСТиповымиДокументами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЗаказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БизнесРегионы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаспоряжениеНаРастарку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ПеремещениеПаллета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЦепочкиВРаспоряженииНаРастарку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерВЦепочке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Метка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_БланкЭтапа</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_ЗаданиеНаУдалениеГП</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_ПеремещениеПаллета</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_ЗаявкаНаОтгрузку</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_ПередачаТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_ОтчетФормщика</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_ФормированиеПаллета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_ПолучениеГПИзПроизводства</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_ЗаявкаНаТранспортировку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТиповойДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннееПотребление</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_СчетНаОплатуКлиенту</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_ПередачаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_БланкЭтапа</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтгрузкаТоваровСХранения</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.ТранспортнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровОтХранителя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ДвижениеПродукцииИМатериалов</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровХранителю</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересчетТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_ЗаявкаНаОтгрузку</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_ПередачаТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_ФормированиеПаллета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемкаТоваровНаХранение</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтборРазмещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуКлиенту</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_ЗаявкаНаТранспортировку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ВидыОпераций_Списание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ВидыОпераций_Списание</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_СписаниеИзЭксплуатации/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения); 		
	КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Дата          = ТекущаяДатаСеанса();
	Ответственный = Пользователи.ТекущийПользователь();
	Структура = Новый Структура;
	Лико_ОбщегоНазначенияСервер.РеквизитыШапки(Структура);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Структура);
КонецПроцедуры

Процедура ПередатьВЭксплуатацию(Отказ) //+Лико m.shenderov 31.10.2017
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	//|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	//|	ТоварыНаСкладахОстатки.Назначение КАК Назначение,
	//|	ТоварыНаСкладахОстатки.Склад КАК Склад,
	//|	ТоварыНаСкладахОстатки.Серия КАК Серия,
	//|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК Количество,
	//|	ТоварыНаСкладахОстатки.Номенклатура.ЕдиницаИзмерения КАК Упаковка,
	//|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК КоличествоУпаковок,
	//|	ВЫБОР
	//|		КОГДА ТоварыНаСкладахОстатки.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.Пустаяссылка)
	//|			ТОГДА 0
	//|		ИНАЧЕ 8
	//|	КОНЕЦ КАК СтатусУказанияСерий
	//|ИЗ
	//|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	//|			&Дата,
	//|			Номенклатура.ВидНоменклатуры.Лико_ТМЦ_ВЭксплуатации
	//|				И Склад = &Склад) КАК ТоварыНаСкладахОстатки";
	//Запрос.УстановитьПараметр("Дата",Месяц);
	//Запрос.УстановитьПараметр("Склад",Склад);
	//РезультатЗапроса = Запрос.Выполнить();

	//
	//РезультатЗапроса = Запрос.Выполнить();
	//Если РезультатЗапроса.Пустой() Тогда
	//	Возврат;
	//КонецЕсли; 
	//ТЗ=РезультатЗапроса.Выгрузить();
	ДокументПередачаВЭксплуатацию=НайтиДокументПередачаВЭксплуатацию();
	//ДокументПередачаВЭксплуатацию=  Документы.ВнутреннееПотреблениеТоваров.СоздатьДокумент();
	
	//ДокументПередачаВЭксплуатацию.Серии.Очистить();
	
	//ЗаполнитьЗначенияСвойств(ДокументПередачаВЭксплуатацию,ЭтотОбъект,,"Ссылка,Дата,ХозяйственнаяОперация");
	ДокументПередачаВЭксплуатацию.Дата=Месяц-1;
	ДокументПередачаВЭксплуатацию.Организация=Организация;
	ДокументПередачаВЭксплуатацию.Подразделение=Подразделение;
	ДокументПередачаВЭксплуатацию.Склад=Склад;
	
	ДокументПередачаВЭксплуатацию.ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию;
	//ДокументПередачаВЭксплуатацию.Товары.Загрузить(ТЗ);
	//ДокументПередачаВЭксплуатацию.Товары.Свернуть("Номенклатура,Характеристика,Упаковка,СтатусУказанияСерий","Количество,КоличествоУпаковок");
	//ОтборПоСерии = Новый Структура;
	//ОтборПоСерии.Вставить("СтатусУказанияСерий",8);
	//ТЗ_ТолькоСерии= Тз.НайтиСтроки(ОтборПоСерии);
	//Для каждого ТЗ_Серия Из ТЗ_ТолькоСерии Цикл
	//	НоаяСерия=ДокументПередачаВЭксплуатацию.Серии.Добавить();
	//	ЗаполнитьЗначенияСвойств(НоаяСерия,ТЗ_Серия);		
	//КонецЦикла;
	
	
	
	ДокументПередачаВЭксплуатацию.Лико_Распоряжение=Ссылка;
	ДокументПередачаВЭксплуатацию.Лико_Помещение=Помещение;
	ДокументПередачаВЭксплуатацию.Подразделение=ПараметрыСеанса.ТекущийПользователь.Подразделение;
	ДокументПередачаВЭксплуатацию.Лико_ВидОперации=Перечисления.Лико_ВидыОпераций_Списание.ПередачаВЭксплуатацию;
	//Для каждого Товар Из ДокументПередачаВЭксплуатацию.Товары Цикл 		
	//	Товар.КатегорияЭксплуатации= Справочники.Лико_ПредопределенныеЗначения.КатегорияЭксплуатации.ЗначениеПараметра;	
	//	Товар.СтатьяРасходов= Товар.КатегорияЭксплуатации.СтатьяРасходов;
	//	Товар.ФизическоеЛицо=ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
	//	Товар.Серия=Неопределено;		
	//КонецЦикла;
	
	Попытка
		ДокументПередачаВЭксплуатацию.Записать(РежимЗаписиДокумента.Запись); 		
	Исключение
		//Отказ = Истина;
		//ДокументПередачаВЭксплуатацию.Записать(РежимЗаписиДокумента.Запись);
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Документ """ + ДокументПередачаВЭксплуатацию + """ не удалось провести! " + ОписаниеОшибки());		
	КонецПопытки;
	
	Если Не Отказ Тогда
		НаборЗаписей = РегистрыСведений.Лико_СвязиСТиповымиДокументами.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Ссылка);
		НоваяЗапись= НаборЗаписей.Добавить();
		НоваяЗапись.Документ=Ссылка;
		НоваяЗапись.ТиповойДокумент=ДокументПередачаВЭксплуатацию.Ссылка;
		НоваяЗапись.НомерВЦепочке=1;
		НаборЗаписей.Записать(Истина);		
	КонецЕсли;
	
	
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 31.10.2017

Функция НайтиДокументПередачаВЭксплуатацию () //+Лико m.shenderov 31.10.2017
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнутреннееПотреблениеТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВнутреннееПотребление КАК ВнутреннееПотреблениеТоваров
	|ГДЕ
	|	ВнутреннееПотреблениеТоваров.Лико_Распоряжение = &Лико_Распоряжение";
	Запрос.УстановитьПараметр("Лико_Распоряжение",Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если  РезультатЗапроса.Пустой() Тогда
		Возврат Документы.ВнутреннееПотребление.СоздатьДокумент();
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Возврат  Выборка.Ссылка.ПолучитьОбъект();
		КонецЦикла;
	КонецЕсли;
	
КонецФункции //-Лико m.shenderov 31.10.2017 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ПередатьВЭксплуатацию(Отказ);
	//СписатьИзЭксплуатации(Отказ);
КонецПроцедуры

Функция НайтиДокументСписанияИзЭксплуатации () //+Лико m.shenderov 31.10.2017
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписаниеИзЭксплуатации.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СписаниеИзЭксплуатации КАК СписаниеИзЭксплуатации
	|ГДЕ
	|	СписаниеИзЭксплуатации.Лико_Распоряжение = &Лико_Распоряжение";
	Запрос.УстановитьПараметр("Лико_Распоряжение",Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если  РезультатЗапроса.Пустой() Тогда
		Возврат Документы.СписаниеИзЭксплуатации.СоздатьДокумент();
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Возврат  Выборка.Ссылка.ПолучитьОбъект();
		КонецЦикла;
	КонецЕсли;
	
КонецФункции //-Лико m.shenderov 31.10.2017 

Процедура СписатьИзЭксплуатации(Отказ) //+Лико m.shenderov 31.10.2017
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТМЦВЭксплуатацииОбороты.Номенклатура КАК Номенклатура,
	|	ТМЦВЭксплуатацииОбороты.Характеристика КАК Характеристика,
	|	ТМЦВЭксплуатацииОбороты.Партия КАК ПартияТМЦВЭксплуатации,
	|	ТМЦВЭксплуатацииОбороты.КоличествоОборот КАК Количество,
	|	ТМЦВЭксплуатацииОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов
	|ИЗ
	|	РегистрНакопления.ТМЦВЭксплуатации.Обороты(
	|			,
	|			&Дата,
	|			,
	|			Организация = &Организация
	|				И Подразделение = &Подразделение) КАК ТМЦВЭксплуатацииОбороты
	|ГДЕ
	|	ТМЦВЭксплуатацииОбороты.КоличествоОборот > 0";
	Запрос.УстановитьПараметр("Дата",Месяц);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("АналитикаРасходов",Подразделение);
	КатегорияЭксплуатации= Справочники.Лико_ПредопределенныеЗначения.КатегорияЭксплуатации.ЗначениеПараметра;	
	Запрос.УстановитьПараметр("СтатьяРасходов",КатегорияЭксплуатации.СтатьяРасходов);


	

	РезультатЗапроса = Запрос.Выполнить();

	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	ТЗ=РезультатЗапроса.Выгрузить();
	ДокументСписанияИзЭксплуатации=НайтиДокументСписанияИзЭксплуатации();
	//ДокументСписанияИзЭксплуатации=  Документы.СписаниеИзЭксплуатации.СоздатьДокумент();
	 
	
	//ЗаполнитьЗначенияСвойств(ДокументПередачаВЭксплуатацию,ЭтотОбъект,,"Ссылка,Дата,ХозяйственнаяОперация");
	ДокументСписанияИзЭксплуатации.Дата=КонецДня(Месяц);
	ДокументСписанияИзЭксплуатации.Организация=Организация;
	ДокументСписанияИзЭксплуатации.Подразделение=Подразделение;
	
	
	ДокументСписанияИзЭксплуатации.Товары.Загрузить(ТЗ);
	
		
	
	
	ДокументСписанияИзЭксплуатации.Лико_Распоряжение=Ссылка;
	
	
	Попытка
		ДокументСписанияИзЭксплуатации.Записать(РежимЗаписиДокумента.Проведение); 		
	Исключение
		//Отказ = Истина;
		ДокументСписанияИзЭксплуатации.Записать(РежимЗаписиДокумента.Запись);
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Документ """ + ДокументСписанияИзЭксплуатации + """ не удалось провести! " + ОписаниеОшибки());		
	КонецПопытки;
	
	Если Не Отказ Тогда
		НаборЗаписей = РегистрыСведений.Лико_СвязиСТиповымиДокументами.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Ссылка);
		НоваяЗапись= НаборЗаписей.Добавить();
		НоваяЗапись.Документ=Ссылка;
		НоваяЗапись.ТиповойДокумент=ДокументСписанияИзЭксплуатации.Ссылка;
		НоваяЗапись.НомерВЦепочке=1;
		НаборЗаписей.Записать(Истина);		
	КонецЕсли;
	
	
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 31.10.2017
